In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [7]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(data = d)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(data=arr)

0    10
1    20
2    30
dtype: int64

In [ ]:
#data frames part 1

In [4]:
import numpy as np
import pandas as pd

In [1]:
from numpy.random import randn

In [5]:
np.random.seed(101)

In [6]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['w','x','y','z'])

In [7]:
df

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [8]:
df['w']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: w, dtype: float64

In [9]:
 type(df['w'])

pandas.core.series.Series

In [13]:
df.w

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: w, dtype: float64

In [14]:
df.loc['A']

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: A, dtype: float64

In [18]:
df.iloc[0]

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: A, dtype: float64

KeyError: "['w'] not found in axis"

In [36]:
df

          x         y         z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [38]:
df

          x         y         z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [39]:
#data frame part 2

In [40]:
df>0

       x      y      z
A   True   True   True
B  False  False   True
C   True   True  False
D  False  False   True
E   True   True   True

In [41]:
df[df>0]

          x         y         z
A  0.628133  0.907969  0.503826
B       NaN       NaN  0.605965
C  0.740122  0.528813       NaN
D       NaN       NaN  0.955057
E  1.978757  2.605967  0.683509

In [42]:
df['x']>0

A     True
B    False
C     True
D    False
E     True
Name: x, dtype: bool

In [43]:
df[df['x']>0]

          x         y         z
A  0.628133  0.907969  0.503826
C  0.740122  0.528813 -0.589001
E  1.978757  2.605967  0.683509

In [44]:
df<0

       x      y      z
A  False  False  False
B   True   True  False
C  False  False   True
D   True   True  False
E  False  False  False

In [46]:
df[df['x']>0]['y']

A    0.907969
C    0.528813
E    2.605967
Name: y, dtype: float64

In [56]:
df[(df['x']>0) & (df['y']>1)]

          x         y         z
E  1.978757  2.605967  0.683509

In [57]:
df.reset_index()

  index         x         y         z
0     A  0.628133  0.907969  0.503826
1     B -0.319318 -0.848077  0.605965
2     C  0.740122  0.528813 -0.589001
3     D -0.758872 -0.933237  0.955057
4     E  1.978757  2.605967  0.683509

In [58]:
newstr='aw ni sh ku ma'.split()

In [59]:
newstr

['aw', 'ni', 'sh', 'ku', 'ma', 'r']

In [68]:
#df ['States'] = newstr

In [67]:
df

          x         y         z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [69]:
#missing value

In [70]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [71]:
df=pd.DataFrame(d)

In [72]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [76]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [79]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [80]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [83]:
df.fillna(value=8)

     A    B  C
0  1.0  5.0  1
1  2.0  8.0  2
2  8.0  8.0  3

In [84]:
#groupby function

In [89]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'Person' :['Sam',
        'Charlie','Amy','Vanessa','Carl','Sarah'],'Sales':[200,120,340,124,243,350]}

In [90]:
df = pd.DataFrame(data)

In [98]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [99]:
byComp = df.groupby('Sales')

In [108]:
byComp.sum()

             Person  Sales
Company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [106]:
byComp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [111]:
byComp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [112]:
#merging , joining, and Concatening

In [113]:
pip install sqlalchemy

Defaulting to user installation because normal site-packages is not writeable
Collecting sqlalchemy
  Downloading SQLAlchemy-2.0.11-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (2.7 MB)
      2.7/2.7 MB 1.7 MB/s eta 0:00:00m eta 0:00:010:01:01
Collecting typing-extensions>=4.2.0
  Downloading typing_extensions-4.5.0-py3-none-any.whl (27 kB)
Collecting greenlet!=0.4.17
  Downloading greenlet-2.0.2-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (613 kB)
      613.7/613.7 KB 1.9 MB/s eta 0:00:00 MB/s eta 0:00:01:01
Installing collected packages: typing-extensions, greenlet, sqlalchemy
Successfully installed greenlet-2.0.2 sqlalchemy-2.0.11 typing-extensions-4.5.0
Note: you may need to restart the kernel to use updated packages.

In [114]:
pip install lxml

Defaulting to user installation because normal site-packages is not writeable
Collecting lxml
  Downloading lxml-4.9.2-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.manylinux_2_24_x86_64.whl (7.1 MB)
      7.1/7.1 MB 2.5 MB/s eta 0:00:00m eta 0:00:01[36m0:00:01
Installing collected packages: lxml
Successfully installed lxml-4.9.2
Note: you may need to restart the kernel to use updated packages.

In [115]:
pip install html5lib

Defaulting to user installation because normal site-packages is not writeable
Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
      112.2/112.2 KB 157.4 kB/s eta 0:00:00 kB/s eta 0:00:01:01
Requirement already satisfied: six>=1.9 in /usr/lib/python3/dist-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in /home/awnish/.local/lib/python3.10/site-packages (from html5lib) (0.5.1)
Installing collected packages: html5lib
Successfully installed html5lib-1.1
Note: you may need to restart the kernel to use updated packages.

In [116]:
pip install BeautifulSoup4

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: BeautifulSoup4 in /home/awnish/.local/lib/python3.10/site-packages (4.12.2)
Requirement already satisfied: soupsieve>1.2 in /home/awnish/.local/lib/python3.10/site-packages (from BeautifulSoup4) (2.4.1)
Note: you may need to restart the kernel to use updated packages.

In [117]:
# data input and output

In [118]:
# CSV, Excel ,HTML , SQL

In [124]:
pip install xlrd

Defaulting to user installation because normal site-packages is not writeable
Collecting xlrd
  Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
      96.5/96.5 KB 1.6 MB/s eta 0:00:00[31m1.1 MB/s eta 0:00:01
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1
Note: you may need to restart the kernel to use updated packages.

In [127]:
# 1st exercises

In [128]:
import pandas as pd